In [2]:
import pandas as pd
df = pd.read_csv("data1.csv")

In [3]:
df

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [5]:
df['Actor']# gives the actor column

0         Shah Rukh Khan
1            Salman Khan
2             Aamir Khan
3          Ranbir Kapoor
4          Ranveer Singh
5     Ayushmann Khurrana
6          Rajkummar Rao
7         Hrithik Roshan
8           Akshay Kumar
9          Kartik Aaryan
10          Varun Dhawan
11         Vicky Kaushal
Name: Actor, dtype: object

In [6]:
df['Actor'][3] # give index 3 of column Actor

'Ranbir Kapoor'

In [8]:
type(df['Actor'])

pandas.core.series.Series

so df['column_name'] gives single column as series

In [10]:
# if i want more than one column
df[['Actor', 'IMDb']]

                 Actor  IMDb
0       Shah Rukh Khan   7.2
1          Salman Khan   6.0
2           Aamir Khan   8.4
3        Ranbir Kapoor   5.6
4        Ranveer Singh   7.0
5   Ayushmann Khurrana   8.3
6        Rajkummar Rao   7.5
7       Hrithik Roshan   6.5
8         Akshay Kumar   7.0
9        Kartik Aaryan   5.9
10        Varun Dhawan   6.1
11       Vicky Kaushal   8.2

In [13]:
# for getting data on base of index like 0, 1, 2 row wise use loc
df.loc[1]# give label base data herewe have same label and position so output is same if index are a,b,c then have to write lic[a]

Actor                       Salman Khan
Film                    Tiger Zinda Hai
Year                               2017
Genre                            Action
BoxOffice(INR Crore)                565
IMDb                                6.0
Name: 1, dtype: object

In [14]:
df.iloc[1] # gives position based data gives index wise even index are a b c

Actor                       Salman Khan
Film                    Tiger Zinda Hai
Year                               2017
Genre                            Action
BoxOffice(INR Crore)                565
IMDb                                6.0
Name: 1, dtype: object

In [15]:
df.loc[8, 'IMDb'] # specific cell e:g gives iMDb of index 8

7.0

In [17]:
 # also use iloc to locate a cell 
df.iloc[8, 5] # iloc always work with index row 8 column 5

7.0

In [22]:
#also can do slicing
df.loc[0:2,['Actor', 'IMDb', 'Film']]# take index 0 to 2 and column actor IMDb and films and note the order is same in output the way i write

            Actor  IMDb             Film
0  Shah Rukh Khan   7.2          Pathaan
1     Salman Khan   6.0  Tiger Zinda Hai
2      Aamir Khan   8.4           Dangal

In [23]:
#by using iloc
df.iloc[0:2, 0:2]

            Actor             Film
0  Shah Rukh Khan          Pathaan
1     Salman Khan  Tiger Zinda Hai

Note: in loc the index 2 is included but in iloc 2 index is not included so its by natural

In [24]:
df.at[0, 'Actor'] # optimized for one element only gives fast access on single element

'Shah Rukh Khan'

In [25]:
df.iat[0, 0]

'Shah Rukh Khan'

In [26]:
#filtering
df[df['IMDb']>6] #gives data with IMDb greater than 6

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [27]:
df[df['IMDb']>7]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [29]:
df[df['IMDb']>8]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [30]:
df[df['IMDb']>7]['Actor'] # if i want actors name only with IMDb greater than 7

0         Shah Rukh Khan
2             Aamir Khan
5     Ayushmann Khurrana
6          Rajkummar Rao
11         Vicky Kaushal
Name: Actor, dtype: object

In [34]:
df[(df['IMDb']>6) & (df['Year']>2019)] # if want to satisfy two conditions

            Actor     Film  Year   Genre  BoxOffice(INR Crore)  IMDb
0  Shah Rukh Khan  Pathaan  2023  Action                  1050   7.2

In [35]:
df[(df['IMDb']>6) & (df['Year']>2018)]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [36]:
df[(df['IMDb']>6) | (df['Year']>2018)]#if want movies with IMDb greater than 6 or year greater than 2018

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [37]:
df.query("Year > 2018 and IMDb > 6") #use string expression more readable

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [1]:
#some problems related to data selection and filtering

In [3]:
#Problem 1: Select Specific Columns
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['Lahore', 'Karachi', 'Islamabad', 'Multan']
}
df = pd.DataFrame(data)

In [4]:
df

      Name  Age       City
0    Alice   25     Lahore
1      Bob   30    Karachi
2  Charlie   35  Islamabad
3    David   40     Multan

In [5]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [6]:
df["Age"]

0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [8]:
df["City"]

0       Lahore
1      Karachi
2    Islamabad
3       Multan
Name: City, dtype: object

In [9]:
# Problem 2: Filter Rows Based on Condition Using the same DataFrame above Select rows where the Age is greater than 30.
df[df["Age"]>30]

      Name  Age       City
2  Charlie   35  Islamabad
3    David   40     Multan

In [10]:
#Problem 3: Multiple Conditions
#Select rows where Marks are greater than 60 and Passed is True.
data = {
    'Name': ['Ali', 'Zara', 'Hina', 'Fahad'],
    'Marks': [80, 45, 90, 65],
    'Passed': [True, False, True, True]
}
df = pd.DataFrame(data)

In [11]:
df

    Name  Marks  Passed
0    Ali     80    True
1   Zara     45   False
2   Hina     90    True
3  Fahad     65    True

In [14]:
df[(df["Marks"]>60)&(df["Passed"]==True)]

    Name  Marks  Passed
0    Ali     80    True
2   Hina     90    True
3  Fahad     65    True

In [15]:
#Problem 4: Select by Index Range Using the same DataFrame from Problem 3 and Select the first two rows using row index.
df #data frame of problem 3

    Name  Marks  Passed
0    Ali     80    True
1   Zara     45   False
2   Hina     90    True
3  Fahad     65    True

In [17]:
df.iloc[0:2]

   Name  Marks  Passed
0   Ali     80    True
1  Zara     45   False

In [18]:
#problem 5: ask: Select rows where Section is either 'A' or 'C'.
data = {
    'Student': ['Adeel', 'Sana', 'Hamza', 'Zainab'],
    'Section': ['A', 'B', 'A', 'C']
}
df = pd.DataFrame(data)
df

  Student Section
0   Adeel       A
1    Sana       B
2   Hamza       A
3  Zainab       C

In [22]:
df.query("Section == 'A' or Section == 'C'")

  Student Section
0   Adeel       A
2   Hamza       A
3  Zainab       C